Revit 2027 API
UnitTypeId.CurrencyPerWatt Property
 Cost per watt.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurrencyPerWatt { get; }
Public Shared ReadOnly Property CurrencyPerWatt As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurrencyPerWatt {
	ForgeTypeId^ get ();
}
static member CurrencyPerWatt : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace